grevaillot/svd_tools/headers/STM32L4S7/gpiof.h
#define GPIOF_OSPEEDR_OSPEEDR7_SHIFT		14
#define GPIOF_OSPEEDR_OSPEEDR7_MASK		0x03
/** @defgroup gpiof_ospeedr_ospeedr7 OSPEEDR7 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_OSPEEDR_OSPEEDR6_SHIFT		12
#define GPIOF_OSPEEDR_OSPEEDR6_MASK		0x03
/** @defgroup gpiof_ospeedr_ospeedr6 OSPEEDR6 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_OSPEEDR_OSPEEDR5_SHIFT		10
#define GPIOF_OSPEEDR_OSPEEDR5_MASK		0x03
/** @defgroup gpiof_ospeedr_ospeedr5 OSPEEDR5 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_OSPEEDR_OSPEEDR4_SHIFT		8
#define GPIOF_OSPEEDR_OSPEEDR4_MASK		0x03
/** @defgroup gpiof_ospeedr_ospeedr4 OSPEEDR4 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_OSPEEDR_OSPEEDR3_SHIFT		6
#define GPIOF_OSPEEDR_OSPEEDR3_MASK		0x03
/** @defgroup gpiof_ospeedr_ospeedr3 OSPEEDR3 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_OSPEEDR_OSPEEDR2_SHIFT		4
#define GPIOF_OSPEEDR_OSPEEDR2_MASK		0x03
/** @defgroup gpiof_ospeedr_ospeedr2 OSPEEDR2 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_OSPEEDR_OSPEEDR1_SHIFT		2
#define GPIOF_OSPEEDR_OSPEEDR1_MASK		0x03
/** @defgroup gpiof_ospeedr_ospeedr1 OSPEEDR1 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_OSPEEDR_OSPEEDR0_SHIFT		0
#define GPIOF_OSPEEDR_OSPEEDR0_MASK		0x03
/** @defgroup gpiof_ospeedr_ospeedr0 OSPEEDR0 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpiof_pupdr PUPDR GPIO port pull-up/pull-down register
@{*/


#define GPIOF_PUPDR_PUPDR15_SHIFT		30
#define GPIOF_PUPDR_PUPDR15_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr15 PUPDR15 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR14_SHIFT		28
#define GPIOF_PUPDR_PUPDR14_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr14 PUPDR14 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR13_SHIFT		26
#define GPIOF_PUPDR_PUPDR13_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr13 PUPDR13 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR12_SHIFT		24
#define GPIOF_PUPDR_PUPDR12_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr12 PUPDR12 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR11_SHIFT		22
#define GPIOF_PUPDR_PUPDR11_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr11 PUPDR11 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR10_SHIFT		20
#define GPIOF_PUPDR_PUPDR10_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr10 PUPDR10 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR9_SHIFT		18
#define GPIOF_PUPDR_PUPDR9_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr9 PUPDR9 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR8_SHIFT		16
#define GPIOF_PUPDR_PUPDR8_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr8 PUPDR8 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR7_SHIFT		14
#define GPIOF_PUPDR_PUPDR7_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr7 PUPDR7 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR6_SHIFT		12
#define GPIOF_PUPDR_PUPDR6_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr6 PUPDR6 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR5_SHIFT		10
#define GPIOF_PUPDR_PUPDR5_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr5 PUPDR5 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR4_SHIFT		8
#define GPIOF_PUPDR_PUPDR4_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr4 PUPDR4 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR3_SHIFT		6
#define GPIOF_PUPDR_PUPDR3_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr3 PUPDR3 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR2_SHIFT		4
#define GPIOF_PUPDR_PUPDR2_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr2 PUPDR2 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR1_SHIFT		2
#define GPIOF_PUPDR_PUPDR1_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr1 PUPDR1 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOF_PUPDR_PUPDR0_SHIFT		0
#define GPIOF_PUPDR_PUPDR0_MASK		0x03
/** @defgroup gpiof_pupdr_pupdr0 PUPDR0 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpiof_idr IDR GPIO port input data register
@{*/

/** GPIOF_IDR_IDR15 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR15		(1 << 15)
/** GPIOF_IDR_IDR14 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR14		(1 << 14)
/** GPIOF_IDR_IDR13 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR13		(1 << 13)
/** GPIOF_IDR_IDR12 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR12		(1 << 12)
/** GPIOF_IDR_IDR11 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR11		(1 << 11)
/** GPIOF_IDR_IDR10 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR10		(1 << 10)
/** GPIOF_IDR_IDR9 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR9		(1 << 9)
/** GPIOF_IDR_IDR8 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR8		(1 << 8)
/** GPIOF_IDR_IDR7 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR7		(1 << 7)
/** GPIOF_IDR_IDR6 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR6		(1 << 6)
/** GPIOF_IDR_IDR5 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR5		(1 << 5)
/** GPIOF_IDR_IDR4 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR4		(1 << 4)
/** GPIOF_IDR_IDR3 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR3		(1 << 3)
/** GPIOF_IDR_IDR2 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR2		(1 << 2)
/** GPIOF_IDR_IDR1 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR1		(1 << 1)
/** GPIOF_IDR_IDR0 Port input data (y = 0..15) **/
#define GPIOF_IDR_IDR0		(1 << 0)

/**@}*/

/** @defgroup gpiof_odr ODR GPIO port output data register
@{*/

/** GPIOF_ODR_ODR15 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR15		(1 << 15)
/** GPIOF_ODR_ODR14 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR14		(1 << 14)
/** GPIOF_ODR_ODR13 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR13		(1 << 13)
/** GPIOF_ODR_ODR12 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR12		(1 << 12)
/** GPIOF_ODR_ODR11 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR11		(1 << 11)
/** GPIOF_ODR_ODR10 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR10		(1 << 10)
/** GPIOF_ODR_ODR9 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR9		(1 << 9)
/** GPIOF_ODR_ODR8 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR8		(1 << 8)
/** GPIOF_ODR_ODR7 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR7		(1 << 7)
/** GPIOF_ODR_ODR6 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR6		(1 << 6)
/** GPIOF_ODR_ODR5 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR5		(1 << 5)
/** GPIOF_ODR_ODR4 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR4		(1 << 4)
/** GPIOF_ODR_ODR3 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR3		(1 << 3)
/** GPIOF_ODR_ODR2 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR2		(1 << 2)
/** GPIOF_ODR_ODR1 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR1		(1 << 1)
/** GPIOF_ODR_ODR0 Port output data (y = 0..15) **/
#define GPIOF_ODR_ODR0		(1 << 0)

/**@}*/

/** @defgroup gpiof_bsrr BSRR GPIO port bit set/reset register
@{*/

